# help('modules') посмотреть список всех загруженных модулей

#______________________________________________________________________________________________________________
# Различные модули

# sys - Системные параметры и функции
# https://docs.python.org/3/library/sys.html#sys.getsizeof
# Этот модуль обеспечивает доступ к некоторым переменным, используемым или поддерживаемым интерпретатором,
# и к функциям, которые сильно взаимодействуют с интерпретатором. Он всегда доступен.
# ________________________________
# Модуль os:  Модуль os предоставляет множество функций для работы с операционной системой, причём их поведение,
# как правило, не зависит от ОС, поэтому программы остаются переносимыми.
# Здесь будут приведены наиболее часто используемые из них. https://pythonworld.ru/moduli/modul-os.html
#_________________________________
# Модуль math:  Модуль math – один из наиважнейших в Python. Этот модуль предоставляет обширный
# функционал для работы с числами. https://pythonworld.ru/moduli/modul-math.html

