# help('modules') посмотреть список всех загруженных модулей

# https://pythonworld.ru/osnovy/rabota-s-modulyami-sozdanie-podklyuchenie-instrukciyami-import-i-from.html

# http://pythonicway.com/python-modules  Модули в Python https://pythoner.name/index.php/documentation/tutorial/modules

# Подключение модуля из стандартной библиотеки:
# https://www.youtube.com/watch?v=GpJRYkzwlpk  Подключение модулей - import modules
# Работа с модулями: создание, подключение инструкциями import и from

#______________________________________________________________________________________________________________
#Стандартные модули
#Python поставляется с библиотекой стандартных модулей, описанных в отдельном документе,
# Справка по библиотеки Python (ниже "Справка по библиотеке"). Несколько модулей встроено в
# интерпретатор; они предоставляют доступ к операциям, которые не являются частью ядра языка,
# но тем не менее встроены в него, либо для повышения эффективности, либо для обеспечения доступа
# к примитивам операционной системы, таким как системные вызовы. Установка таких модулей является
# конфигурационной опцией, которая также зависит от используемой платформы.


#______________________________________________________________________________________________________________
# Различные модули
# sys - Системные параметры и функции
# https://docs.python.org/3/library/sys.html#sys.getsizeof
# Этот модуль обеспечивает доступ к некоторым переменным, используемым или поддерживаемым интерпретатором,
# и к функциям, которые сильно взаимодействуют с интерпретатором. Он всегда доступен.
# ________________________________
# Модуль os:  Модуль os предоставляет множество функций для работы с операционной системой, причём их поведение,
# как правило, не зависит от ОС, поэтому программы остаются переносимыми.
# Здесь будут приведены наиболее часто используемые из них. https://pythonworld.ru/moduli/modul-os.html
#_________________________________
# Модуль math:  Модуль math – один из наиважнейших в Python. Этот модуль предоставляет обширный
# функционал для работы с числами. https://pythonworld.ru/moduli/modul-math.html

