# ______________________________________________________________________________________________________________
# Различные модули
# стандартная библиотке Python
# https://ru.wikipedia.org/wiki/%D0%A1%D1%82%D0%B0%D0%BD%D0%B4%D0%B0%D1%80%D1%82%D0%BD%D0%B0%D1%8F_%D0%B1%D0%B8%D0%B1%D0%BB%D0%B8%D0%BE%D1%82%D0%B5%D0%BA%D0%B0_Python

# sys - Системные параметры и функции
# https://docs.python.org/3/library/sys.html#sys.getsizeof
# Этот модуль обеспечивает доступ к некоторым переменным, используемым или поддерживаемым интерпретатором,
# и к функциям, которые сильно взаимодействуют с интерпретатором. Он всегда доступен.
# ________________________________
# Модуль os:  Модуль os предоставляет множество функций для работы с операционной системой, причём их поведение,
# как правило, не зависит от ОС, поэтому программы остаются переносимыми.
# Здесь будут приведены наиболее часто используемые из них. https://pythonworld.ru/moduli/modul-os.html
#_________________________________
# Модуль math:  Модуль math – один из наиважнейших в Python. Этот модуль предоставляет обширный
# функционал для работы с числами. https://pythonworld.ru/moduli/modul-math.html

